#include "common.h"

void RunLED_Config(void);		//运行灯初始化
void Comm_Config(void);		//双机通信SPI主控制器初始化


/*********************************************************** 
函数名称：Motor_ChangeSpeed
函数功能：改变小车运行速度
入口参数：val - 目标速度(毫米/秒) 
出口参数：无 
***********************************************************/
void Motor_ChangeSpeed(s16 val);

/*********************************************************** 
函数名称：SD5_ChangeDuty
函数功能：改变舵机占空比
入口参数：val - 占空比(0-10000, 中值5000) 
出口参数：无 
***********************************************************/
void SD5_ChangeDuty(u16 val);

/*********************************************************** 
函数名称：PID_Change
函数功能：改变PID参数
入口参数：reg - 需改变的参数（P_SET, I_SET, D_SET）
					val - 目标值
出口参数：无 
***********************************************************/
void PID_Change(u8 reg, double val);

/*********************************************************** 
函数名称：GetSpeed
函数功能：获取实时速度
入口参数：*dat - 欲写入变量
出口参数：0 - 失败, 1 - 成功
***********************************************************/
u8 GetSpeed(s16 *dat);

/*********************************************************** 
函数名称：Get_PID
函数功能：改变PID参数
入口参数：reg - 需读取的参数（P_READ, I_READ, D_READ）
					*dat - 欲写入变量
出口参数：0 - 失败, 1 - 成功
***********************************************************/
u8 Get_PID(u8 reg, double *dat);

/* 返回信息定义 ***************************************************************/
#define SPEED_SET			0xA1		//设置电机速度
#define P_SET					0xA2		//设置电机P值
#define I_SET					0xA3		//设置电机I值
#define D_SET					0xA4		//设置电机D值
#define SD5_SET				0xA5		//设置舵机打角

#define SPEED_READ		0xB1		//读电机速度
#define P_READ				0xB2		//读电机P值
#define I_READ				0xB3		//读电机I值
#define D_READ				0xB4		//读电机D值

/*******************************************************************************/