#include "common.h"
#include "OV7725.h"

void OLED_Config(void);		//OLED显示屏初始化


/*********************************************************** 
函数名称：OLED_Clear
函数功能：清屏指令
入口参数：Color - 写1全白,写0全黑
出口参数：无 
***********************************************************/
void OLED_Clear(u8 Color);

/*********************************************************** 
函数名称：OLED_WriteChar
函数功能：向指定位置写入一个字符
入口参数：x  - 横坐标(0-127)
					y  - 纵坐标(0-3)
					ch - 需写入字符
					set- 是否反色显示(写1开启反色)
出口参数：无 
***********************************************************/
void OLED_WriteChar(u8 x, u8 y, char ch, u8 set);

/*********************************************************** 
函数名称：OLED_WriteStr
函数功能：向指定位置写入一个字符
入口参数：x  - 横坐标(0-127)
					y  - 纵坐标(0-3)
					ch - 需写入字符串
					set- 是否反色显示(写1开启反色)
出口参数：无 
***********************************************************/
void OLED_WriteStr(u8 x, u8 y, char *s, u8 set);

/*********************************************************** 
函数名称：OLED_DrawImage
函数功能：在屏幕上画一个80*60的图像
入口参数：无
出口参数：无 
备注：自动调取Image_Convent数组中数据打印在屏幕上
***********************************************************/
void OLED_DrawImage(void);
